// Напишите программу, которая выводит числа из отре

int num = new Random().Next(10,99);
Console.WriteLine(num);
int s1 = num/10;
int s2 = num%10;
Console.WriteLine(s1+" "+s2);
